onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/ДК_РаботаСФормойСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Дополняет Форму документа реквизитом контактное лицо
// Дополняет Форму документа ЗаказПокупателя реквизитом Согласованная скидка
// Параметр: 
//   Форма - ФормаКлиентскогоПриложения.
//
Процедура ДополнениеФормы(Форма)Экспорт 
	 
	 ИмяФормы = Форма.ИмяФормы;
	 
	 ИмяФормы = Форма.ИмяФормы;
	 Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		 
		  ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма);
		  ДобавитьГруппуПересчетНаФорму(Форма);
          ДобавитьРеквизитСогласованнаяСкидкаНаФорму(Форма);
		  
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
		  ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		 
		 ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма);
		 
	 ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		 
		 СледующийЭлемент = Форма.Элементы.Основание;
		 ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,СледующийЭлемент);
		 
	 ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		 
		 СледующийЭлемент = Форма.Элементы.СуммаДокумента;
		 ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,СледующийЭлемент);
		 
	 КонецЕсли; 
	 
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитКонтактноеЛицоНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Контактное лицо";
		 	 
КонецПроцедуры

Процедура ВставитьРеквизитКонтактноеЛицоНаФормуПередЭлементом(Форма,Элемент);
	
	НовыйЭлемент = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Элемент);
	НовыйЭлемент.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Контактное лицо";
	
КонецПроцедуры 

Процедура ДобавитьГруппуПересчетНаФорму(Форма);
	
	Группа = Форма.Элементы.Добавить("ГруппаПересчет",Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
КонецПроцедуры

Процедура ДобавитьРеквизитСогласованнаяСкидкаНаФорму(Форма);
	
	НовыйЭлемент = Форма.Элементы.Добавить("СогласованнаяСкидка",Тип("ПолеФормы"),Форма.Элементы.ГруппаПересчет);
	НовыйЭлемент.ПутьКДанным = "Объект.ДК_СогласованнаяСкидка";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Согласованная скидка";
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ДК_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры

#КонецОбласти
